### Welcome to Pandas Tutorials (Class 5)
### This note book covers the following 
### One dimensional data in Pandas
### Two dimensional or Cross Sectional data in Pandas
### Pandas indexing and Slicing 
### Basic Pandas ops

## What is pandas?
## Why pandas?

### One dimensional data in pandas are called Series

In [121]:
x = pd.Series([1,2,3,4,5])

In [122]:
type(x)

pandas.core.series.Series

### Sereis indexing

In [123]:
# Series Data 
for i in range(len(x)):
    print("This index of this element is ", i ," and it's value is", x[i])

This index of this element is  0  and it's value is 1
This index of this element is  1  and it's value is 2
This index of this element is  2  and it's value is 3
This index of this element is  3  and it's value is 4
This index of this element is  4  and it's value is 5

### We can also specify user defined indexes

In [124]:
x.index =  ["First", "Second", "Third", "Forth", "Fifth"]

In [125]:
print(x)

print (" \n \n Frist is the index of the element", x['First'], "\n \n")

First     1
Second    2
Third     3
Forth     4
Fifth     5
dtype: int64


 Frist is the index of the element 1


##### To create a array format of a series

In [126]:
x.values # creates a array format of a series

array([1, 2, 3, 4, 5], dtype=int64)

In [127]:
# Checking the shape of the series
print(x.shape) # Prints shape of the one dimesional array
print(len(x)) # print the length of the series

(5,)
5

### Updating a series value using the index

In [128]:
x['Second'] = x['Second']**2

In [129]:
print(x['Second'])

4

### Filtering using series indexes

In [130]:
bacteria = pd.Series([632, 1638, 569, 115], 
    index=['Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteroidetes'])

bacteria['Firmicutes']

632

In [131]:
bacteria[[name.endswith('bacteria') for name in bacteria.index]] ## Who can explain this code???

Proteobacteria    1638
Actinobacteria     569
dtype: int64

In [132]:
# Naming a series
bacteria.name = 'BACTERIUMS'

In [133]:
# Naming thee series column
bacteria.index.name = "Bacteria names"

In [134]:
bacteria

Bacteria names
Firmicutes         632
Proteobacteria    1638
Actinobacteria     569
Bacteroidetes      115
Name: BACTERIUMS, dtype: int64

### Filtering the series using values

In [135]:
bacteria[bacteria > 600]

Bacteria names
Firmicutes         632
Proteobacteria    1638
Name: BACTERIUMS, dtype: int64

### Converting a dictionary to series

In [136]:
dic_values = {'Firmicutes': 134 , 'Proteobacteria': 156, 'Actinobacteria': 145, 'Bacteroidetes':100}
new_bacateria = pd.Series(dic_values)

In [137]:
new_bacateria

Firmicutes        134
Proteobacteria    156
Actinobacteria    145
Bacteroidetes     100
dtype: int64

In [138]:
print(new_bacateria['Firmicutes'])

134

### Checking null values of a Series

In [139]:
# Checking null values of a Series
new_bacateria.isnull().sum()

0

### Adding two series

In [140]:
y = pd.Series([4,5,6,7], index = bacteria.index)

In [141]:
sum_two_series = y +new_bacateria

In [142]:
sum_two_series

Bacteria names
Firmicutes        138
Proteobacteria    161
Actinobacteria    151
Bacteroidetes     107
dtype: int64

## Hands On 
### Create a series using np.arange()
### Then Explicitly provide name, indexes, index name to the series
### Filter the series using indexes and the values

## Knock Knock 
## 2D data
### Two dimensional data in Pandas, the two dimensional data are accessed a DataFrame in the pandas environment

In [3]:
### Syntax to create a data frame
import pandas as pd
data = pd.DataFrame({'value':[632, 1638, 569, 115, 433, 1130, 754, 555],
                     'patient':[1, 1, 1, 1, 2, 2, 2, 2],
                     'phylum':['Firmicutes', 'Proteobacteria', 'Actinobacteria', 
    'Bacteroidetes', 'Firmicutes', 'Proteobacteria', 'Actinobacteria', 'Bacteroidetes']})
data

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes
5   1130        2  Proteobacteria
6    754        2  Actinobacteria
7    555        2   Bacteroidetes

### Knowing about the dataframe

In [165]:
data.shape # Prints the shape of the dataframe

(8, 3)

In [166]:
data.columns # Produces the columns of the dataframe

Index(['value', 'patient', 'phylum'], dtype='object')

In [167]:
# Accessing a single column using of the dataframe
data['value']

0     632
1    1638
2     569
3     115
4     433
5    1130
6     754
7     555
Name: value, dtype: int64

In [168]:
data[['value']]

   value
0    632
1   1638
2    569
3    115
4    433
5   1130
6    754
7    555

### Guess what's the difference betwween [] and [[]]

In [169]:
print(type(data['value']),"is what is meant by []")
print(type(data[['value']]), "is what is meant by [[]]")

<class 'pandas.core.series.Series'> is what is meant by []
<class 'pandas.core.frame.DataFrame'> is what is meant by [[]]

### Slicing and indexing data frames

In [170]:
data

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes
5   1130        2  Proteobacteria
6    754        2  Actinobacteria
7    555        2   Bacteroidetes

In [171]:
# Dataframe slicing is very similar to dataframe array slicing
# Dataframe slicing using iloc
data.iloc[0,0]

632

In [172]:
data.iloc[:,[0,1]]

   value  patient
0    632        1
1   1638        1
2    569        1
3    115        1
4    433        2
5   1130        2
6    754        2
7    555        2

In [173]:
# Dataframe slicing using loc
data.loc[:, 'value']

0     632
1    1638
2     569
3     115
4     433
5    1130
6     754
7     555
Name: value, dtype: int64

In [174]:
data.loc[:, ['value','patient','phylum']]

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes
5   1130        2  Proteobacteria
6    754        2  Actinobacteria
7    555        2   Bacteroidetes

### Adding indexes to the dataframe

In [175]:
data.index = ['One', 'Two', 'Three', 'Four','Five','Six','Seven','Eight']
# The default indexes is going to be 0-1

In [176]:
data

       value  patient          phylum
One      632        1      Firmicutes
Two     1638        1  Proteobacteria
Three    569        1  Actinobacteria
Four     115        1   Bacteroidetes
Five     433        2      Firmicutes
Six     1130        2  Proteobacteria
Seven    754        2  Actinobacteria
Eight    555        2   Bacteroidetes

In [177]:
data.loc['One', 'value']

632

### Deleting a pandas column

In [184]:
data_2  = data.copy() # if copy is not used, then the changes made in data_2 will also reflect on data

In [185]:
del data_2['phylum']

In [186]:
data_2

   value  patient
0    632        1
1   1638        1
2    569        1
3    115        1
4    433        2
5   1130        2
6    754        2
7    555        2

In [187]:
data

   value  patient          phylum
0    632        1      Firmicutes
1   1638        1  Proteobacteria
2    569        1  Actinobacteria
3    115        1   Bacteroidetes
4    433        2      Firmicutes
5   1130        2  Proteobacteria
6    754        2  Actinobacteria
7    555        2   Bacteroidetes

In [188]:
# Another way to remove a column is using pop()
# pop works similar to how it worked in lists
data_2.pop('value')

0     632
1    1638
2     569
3     115
4     433
5    1130
6     754
7     555
Name: value, dtype: int64

In [190]:
data_2

   patient
0        1
1        1
2        1
3        1
4        2
5        2
6        2
7        2

### Importing data using pandas

In [191]:
#pd.read_csv() is used to read a csv file using pandas
#pd.read_excel() is  used to read excel file
#pd.read_json() is used to read a jaason file

#### Here we will read a csv file using pd.read_csv() and perform analysis on the same

In [196]:
Startups = pd.read_csv('50_Startups.csv')

In [197]:
Startups

    R&D Spend  Administration  Marketing Spend       State     Profit
0   165349.20       136897.80        471784.10    New York  192261.83
1   162597.70       151377.59        443898.53  California  191792.06
2   153441.51       101145.55        407934.54     Florida  191050.39
3   144372.41       118671.85        383199.62    New York  182901.99
4   142107.34        91391.77        366168.42     Florida  166187.94
5   131876.90        99814.71        362861.36    New York  156991.12
6   134615.46       147198.87        127716.82  California  156122.51
7   130298.13       145530.06        323876.68     Florida  155752.60
8   120542.52       148718.95        311613.29    New York  152211.77
9   123334.88       108679.17        304981.62  California  149759.96
10  101913.08       110594.11        229160.95     Florida  146121.95
11  100671.96        91790.61        249744.55  California  144259.40
12   93863.75       127320.38        249839.44     Florida  141585.52
13   91992.39       135495.07        252664.93  California  134307.35
14  119943.24       156547.42        256512.92     Florida  132602.65
15  114523.61       122616.84        261776.23    New York  129917.04
16   78013.11       121597.55        264346.06  California  126992.93
17   94657.16       145077.58        282574.31    New York  125370.37
18   91749.16       114175.79        294919.57     Florida  124266.90
19   86419.70       153514.11             0.00    New York  122776.86
20   76253.86       113867.30        298664.47  California  118474.03
21   78389.47       153773.43        299737.29    New York  111313.02
22   73994.56       122782.75        303319.26     Florida  110352.25
23   67532.53       105751.03        304768.73     Florida  108733.99
24   77044.01        99281.34        140574.81    New York  108552.04
25   64664.71       139553.16        137962.62  California  107404.34
26   75328.87       144135.98        134050.07     Florida  105733.54
27   72107.60       127864.55        353183.81    New York  105008.31
28   66051.52       182645.56        118148.20     Florida  103282.38
29   65605.48       153032.06        107138.38    New York  101004.64
30   61994.48       115641.28         91131.24     Florida   99937.59
31   61136.38       152701.92         88218.23    New York   97483.56
32   63408.86       129219.61         46085.25  California   97427.84
33   55493.95       103057.49        214634.81     Florida   96778.92
34   46426.07       157693.92        210797.67  California   96712.80
35   46014.02        85047.44        205517.64    New York   96479.51
36   28663.76       127056.21        201126.82     Florida   90708.19
37   44069.95        51283.14        197029.42  California   89949.14
38   20229.59        65947.93        185265.10    New York   81229.06
39   38558.51        82982.09        174999.30  California   81005.76
40   28754.33       118546.05        172795.67  California   78239.91
41   27892.92        84710.77        164470.71     Florida   77798.83
42   23640.93        96189.63        148001.11  California   71498.49
43   15505.73       127382.30         35534.17    New York   69758.98
44   22177.74       154806.14         28334.72  California   65200.33
45    1000.23       124153.04          1903.93    New York   64926.08
46    1315.46       115816.21        297114.46     Florida   49490.75
47       0.00       135426.92             0.00  California   42559.73
48     542.05        51743.15             0.00    New York   35673.41
49       0.00       116983.80         45173.06  California   14681.40

In [198]:
Startups.shape

(50, 5)

In [200]:
Startups.columns

Index(['R&D Spend', 'Administration', 'Marketing Spend', 'State', 'Profit'], dtype='object')

In [201]:
Startups.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

### The describe function

In [205]:
Startups.describe() ## Pandas makes our lives simple ;D
## Gives the five quantile summary of the numerical columns in the dataframe

           R&D Spend  Administration  Marketing Spend         Profit
count      50.000000       50.000000        50.000000      50.000000
mean    73721.615600   121344.639600    211025.097800  112012.639200
std     45902.256482    28017.802755    122290.310726   40306.180338
min         0.000000    51283.140000         0.000000   14681.400000
25%     39936.370000   103730.875000    129300.132500   90138.902500
50%     73051.080000   122699.795000    212716.240000  107978.190000
75%    101602.800000   144842.180000    299469.085000  139765.977500
max    165349.200000   182645.560000    471784.100000  192261.830000

In [208]:
Startups.describe(include = 'all')
## The 5 quantile summary of the numerical columns of the dataframe
## And also gives the uniquem, top and frequency of the non numerical columns

,R&D Spend,Administration,Marketing Spend,State,Profit
count,50.000000,50.000000,50.000000,50,50.000000
unique,NaN,NaN,NaN,3,NaN
top,NaN,NaN,NaN,California,NaN
freq,NaN,NaN,NaN,17,NaN
mean,73721.615600,121344.639600,211025.097800,NaN,112012.639200
std,45902.256482,28017.802755,122290.310726,NaN,40306.180338
min,0.000000,51283.140000,0.000000,NaN,14681.400000
25%,39936.370000,103730.875000,129300.132500,NaN,90138.902500
50%,73051.080000,122699.795000,212716.240000,NaN,107978.190000
75%,101602.800000,144842.180000,299469.085000,NaN,139765.977500
max,165349.200000,182645.560000,471784.100000,NaN,192261.830000

### Filtering the dataframe

In [210]:
High_revenew_Statups = Startups[Startups['Profit'] > 139765]

In [211]:
High_revenew_Statups

    R&D Spend  Administration  Marketing Spend       State     Profit
0   165349.20       136897.80        471784.10    New York  192261.83
1   162597.70       151377.59        443898.53  California  191792.06
2   153441.51       101145.55        407934.54     Florida  191050.39
3   144372.41       118671.85        383199.62    New York  182901.99
4   142107.34        91391.77        366168.42     Florida  166187.94
5   131876.90        99814.71        362861.36    New York  156991.12
6   134615.46       147198.87        127716.82  California  156122.51
7   130298.13       145530.06        323876.68     Florida  155752.60
8   120542.52       148718.95        311613.29    New York  152211.77
9   123334.88       108679.17        304981.62  California  149759.96
10  101913.08       110594.11        229160.95     Florida  146121.95
11  100671.96        91790.61        249744.55  California  144259.40
12   93863.75       127320.38        249839.44     Florida  141585.52

### Explict filering in pandas

In [220]:
x = Startups['Profit'] > 139765

In [221]:
Startups[x]

    R&D Spend  Administration  Marketing Spend       State     Profit
0   165349.20       136897.80        471784.10    New York  192261.83
1   162597.70       151377.59        443898.53  California  191792.06
2   153441.51       101145.55        407934.54     Florida  191050.39
3   144372.41       118671.85        383199.62    New York  182901.99
4   142107.34        91391.77        366168.42     Florida  166187.94
5   131876.90        99814.71        362861.36    New York  156991.12
6   134615.46       147198.87        127716.82  California  156122.51
7   130298.13       145530.06        323876.68     Florida  155752.60
8   120542.52       148718.95        311613.29    New York  152211.77
9   123334.88       108679.17        304981.62  California  149759.96
10  101913.08       110594.11        229160.95     Florida  146121.95
11  100671.96        91790.61        249744.55  California  144259.40
12   93863.75       127320.38        249839.44     Florida  141585.52

### Multifilter

In [226]:
Startups[(Startups['Administration'] > 101602) & (Startups['Profit'] > 144259) & (Startups['State'] == 'New York')]

# P.S the and keyword will not work here 
# Explit filtering also works in this case

   R&D Spend  Administration  Marketing Spend     State     Profit
0  165349.20       136897.80        471784.10  New York  192261.83
3  144372.41       118671.85        383199.62  New York  182901.99
8  120542.52       148718.95        311613.29  New York  152211.77

# Assignment on Pandas class 1

Find the state wise top 10 statups with respect to Profit vs Sum of Operational Expenditure. And Pirnt them as three seperate DataFrames, Happy Analysis.

In [1]:
import pandas as pd

In [2]:
Startups = pd.read_csv('50_Startups.csv')

In [4]:
Startups['NetSpend'] = Startups['Administration'] + Startups['Marketing Spend']

In [8]:
Startups['Profit%'] = (Startups['NetSpend'] - Startups['Profit'])*100/Startups['NetSpend']

In [19]:
TopNewYork = Startups[(Startups['State'] == 'New York')].sort_values(['Profit%'],ascending=False).head(10)

In [21]:
TopNewYork

,R&D Spend,Administration,Marketing Spend,State,Profit,NetSpend,Profit%
27,72107.60,127864.55,353183.81,New York,105008.31,481048.36,78.170945
21,78389.47,153773.43,299737.29,New York,111313.02,453510.72,75.455262
17,94657.16,145077.58,282574.31,New York,125370.37,427651.89,70.684014
0,165349.20,136897.80,471784.10,New York,192261.83,608681.90,68.413414
38,20229.59,65947.93,185265.10,New York,81229.06,251213.03,67.665268
8,120542.52,148718.95,311613.29,New York,152211.77,460332.24,66.934367
35,46014.02,85047.44,205517.64,New York,96479.51,290565.08,66.795903
15,114523.61,122616.84,261776.23,New York,129917.04,384393.07,66.202034
5,131876.90,99814.71,362861.36,New York,156991.12,462676.07,66.068891
3,144372.41,118671.85,383199.62,New York,182901.99,501871.47,63.556010

In [22]:
TopCalifornia = Startups[(Startups['State'] == 'California')].sort_values(['Profit%'],ascending=False).head(10)

In [23]:
TopCalifornia

,R&D Spend,Administration,Marketing Spend,State,Profit,NetSpend,Profit%
49,0.00,116983.80,45173.06,California,14681.40,162156.86,90.946174
34,46426.07,157693.92,210797.67,California,96712.80,368491.59,73.754408
40,28754.33,118546.05,172795.67,California,78239.91,291341.72,73.144969
20,76253.86,113867.30,298664.47,California,118474.03,412531.77,71.281235
42,23640.93,96189.63,148001.11,California,71498.49,244190.74,70.720229
39,38558.51,82982.09,174999.30,California,81005.76,257981.39,68.600154
47,0.00,135426.92,0.00,California,42559.73,135426.92,68.573656
1,162597.70,151377.59,443898.53,California,191792.06,595276.12,67.780992
16,78013.11,121597.55,264346.06,California,126992.93,385943.61,67.095470
13,91992.39,135495.07,252664.93,California,134307.35,388160.00,65.398972

In [24]:
TopFlorida = Startups[(Startups['State'] == 'Florida')].sort_values(['Profit%'],ascending=False).head(10)

In [25]:
TopFlorida

,R&D Spend,Administration,Marketing Spend,State,Profit,NetSpend,Profit%
46,1315.46,115816.21,297114.46,Florida,49490.75,412930.67,88.014756
22,73994.56,122782.75,303319.26,Florida,110352.25,426102.01,74.101918
23,67532.53,105751.03,304768.73,Florida,108733.99,410519.76,73.513092
36,28663.76,127056.21,201126.82,Florida,90708.19,328183.03,72.360487
18,91749.16,114175.79,294919.57,Florida,124266.90,409095.36,69.623977
33,55493.95,103057.49,214634.81,Florida,96778.92,317692.30,69.536901
41,27892.92,84710.77,164470.71,Florida,77798.83,249181.48,68.778245
14,119943.24,156547.42,256512.92,Florida,132602.65,413060.34,67.897511
7,130298.13,145530.06,323876.68,Florida,155752.60,469406.74,66.819266
28,66051.52,182645.56,118148.20,Florida,103282.38,300793.76,65.663390